keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxMsc_bf.h
/** \\brief  Mask for Ifx_MSC_DSDSH_Bits.SH6 */
#define IFX_MSC_DSDSH_SH6_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSH_Bits.SH6 */
#define IFX_MSC_DSDSH_SH6_OFF (12)

/** \\brief  Length for Ifx_MSC_DSDSH_Bits.SH7 */
#define IFX_MSC_DSDSH_SH7_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSH_Bits.SH7 */
#define IFX_MSC_DSDSH_SH7_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSH_Bits.SH7 */
#define IFX_MSC_DSDSH_SH7_OFF (14)

/** \\brief  Length for Ifx_MSC_DSDSH_Bits.SH8 */
#define IFX_MSC_DSDSH_SH8_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSH_Bits.SH8 */
#define IFX_MSC_DSDSH_SH8_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSH_Bits.SH8 */
#define IFX_MSC_DSDSH_SH8_OFF (16)

/** \\brief  Length for Ifx_MSC_DSDSH_Bits.SH9 */
#define IFX_MSC_DSDSH_SH9_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSH_Bits.SH9 */
#define IFX_MSC_DSDSH_SH9_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSH_Bits.SH9 */
#define IFX_MSC_DSDSH_SH9_OFF (18)

/** \\brief  Length for Ifx_MSC_DSDSHE_Bits.SH16 */
#define IFX_MSC_DSDSHE_SH16_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSHE_Bits.SH16 */
#define IFX_MSC_DSDSHE_SH16_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSHE_Bits.SH16 */
#define IFX_MSC_DSDSHE_SH16_OFF (0)

/** \\brief  Length for Ifx_MSC_DSDSHE_Bits.SH17 */
#define IFX_MSC_DSDSHE_SH17_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSHE_Bits.SH17 */
#define IFX_MSC_DSDSHE_SH17_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSHE_Bits.SH17 */
#define IFX_MSC_DSDSHE_SH17_OFF (2)

/** \\brief  Length for Ifx_MSC_DSDSHE_Bits.SH18 */
#define IFX_MSC_DSDSHE_SH18_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSHE_Bits.SH18 */
#define IFX_MSC_DSDSHE_SH18_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSHE_Bits.SH18 */
#define IFX_MSC_DSDSHE_SH18_OFF (4)

/** \\brief  Length for Ifx_MSC_DSDSHE_Bits.SH19 */
#define IFX_MSC_DSDSHE_SH19_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSHE_Bits.SH19 */
#define IFX_MSC_DSDSHE_SH19_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSHE_Bits.SH19 */
#define IFX_MSC_DSDSHE_SH19_OFF (6)

/** \\brief  Length for Ifx_MSC_DSDSHE_Bits.SH20 */
#define IFX_MSC_DSDSHE_SH20_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSHE_Bits.SH20 */
#define IFX_MSC_DSDSHE_SH20_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSHE_Bits.SH20 */
#define IFX_MSC_DSDSHE_SH20_OFF (8)

/** \\brief  Length for Ifx_MSC_DSDSHE_Bits.SH21 */
#define IFX_MSC_DSDSHE_SH21_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSHE_Bits.SH21 */
#define IFX_MSC_DSDSHE_SH21_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSHE_Bits.SH21 */
#define IFX_MSC_DSDSHE_SH21_OFF (10)

/** \\brief  Length for Ifx_MSC_DSDSHE_Bits.SH22 */
#define IFX_MSC_DSDSHE_SH22_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSHE_Bits.SH22 */
#define IFX_MSC_DSDSHE_SH22_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSHE_Bits.SH22 */
#define IFX_MSC_DSDSHE_SH22_OFF (12)

/** \\brief  Length for Ifx_MSC_DSDSHE_Bits.SH23 */
#define IFX_MSC_DSDSHE_SH23_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSHE_Bits.SH23 */
#define IFX_MSC_DSDSHE_SH23_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSHE_Bits.SH23 */
#define IFX_MSC_DSDSHE_SH23_OFF (14)

/** \\brief  Length for Ifx_MSC_DSDSHE_Bits.SH24 */
#define IFX_MSC_DSDSHE_SH24_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSHE_Bits.SH24 */
#define IFX_MSC_DSDSHE_SH24_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSHE_Bits.SH24 */
#define IFX_MSC_DSDSHE_SH24_OFF (16)

/** \\brief  Length for Ifx_MSC_DSDSHE_Bits.SH25 */
#define IFX_MSC_DSDSHE_SH25_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSHE_Bits.SH25 */
#define IFX_MSC_DSDSHE_SH25_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSHE_Bits.SH25 */
#define IFX_MSC_DSDSHE_SH25_OFF (18)

/** \\brief  Length for Ifx_MSC_DSDSHE_Bits.SH26 */
#define IFX_MSC_DSDSHE_SH26_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSHE_Bits.SH26 */
#define IFX_MSC_DSDSHE_SH26_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSHE_Bits.SH26 */
#define IFX_MSC_DSDSHE_SH26_OFF (20)

/** \\brief  Length for Ifx_MSC_DSDSHE_Bits.SH27 */
#define IFX_MSC_DSDSHE_SH27_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSHE_Bits.SH27 */
#define IFX_MSC_DSDSHE_SH27_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSHE_Bits.SH27 */
#define IFX_MSC_DSDSHE_SH27_OFF (22)

/** \\brief  Length for Ifx_MSC_DSDSHE_Bits.SH28 */
#define IFX_MSC_DSDSHE_SH28_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSHE_Bits.SH28 */
#define IFX_MSC_DSDSHE_SH28_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSHE_Bits.SH28 */
#define IFX_MSC_DSDSHE_SH28_OFF (24)

/** \\brief  Length for Ifx_MSC_DSDSHE_Bits.SH29 */
#define IFX_MSC_DSDSHE_SH29_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSHE_Bits.SH29 */
#define IFX_MSC_DSDSHE_SH29_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSHE_Bits.SH29 */
#define IFX_MSC_DSDSHE_SH29_OFF (26)

/** \\brief  Length for Ifx_MSC_DSDSHE_Bits.SH30 */
#define IFX_MSC_DSDSHE_SH30_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSHE_Bits.SH30 */
#define IFX_MSC_DSDSHE_SH30_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSHE_Bits.SH30 */
#define IFX_MSC_DSDSHE_SH30_OFF (28)

/** \\brief  Length for Ifx_MSC_DSDSHE_Bits.SH31 */
#define IFX_MSC_DSDSHE_SH31_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSHE_Bits.SH31 */
#define IFX_MSC_DSDSHE_SH31_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSHE_Bits.SH31 */
#define IFX_MSC_DSDSHE_SH31_OFF (30)

/** \\brief  Length for Ifx_MSC_DSDSL_Bits.SL0 */
#define IFX_MSC_DSDSL_SL0_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSL_Bits.SL0 */
#define IFX_MSC_DSDSL_SL0_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSL_Bits.SL0 */
#define IFX_MSC_DSDSL_SL0_OFF (0)

/** \\brief  Length for Ifx_MSC_DSDSL_Bits.SL10 */
#define IFX_MSC_DSDSL_SL10_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSL_Bits.SL10 */
#define IFX_MSC_DSDSL_SL10_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSL_Bits.SL10 */
#define IFX_MSC_DSDSL_SL10_OFF (20)

/** \\brief  Length for Ifx_MSC_DSDSL_Bits.SL11 */
#define IFX_MSC_DSDSL_SL11_LEN (2)

