keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxMsc_bf.h
/** \\brief  Mask for Ifx_MSC_DSDSLE_Bits.SL25 */
#define IFX_MSC_DSDSLE_SL25_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSLE_Bits.SL25 */
#define IFX_MSC_DSDSLE_SL25_OFF (18)

/** \\brief  Length for Ifx_MSC_DSDSLE_Bits.SL26 */
#define IFX_MSC_DSDSLE_SL26_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSLE_Bits.SL26 */
#define IFX_MSC_DSDSLE_SL26_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSLE_Bits.SL26 */
#define IFX_MSC_DSDSLE_SL26_OFF (20)

/** \\brief  Length for Ifx_MSC_DSDSLE_Bits.SL27 */
#define IFX_MSC_DSDSLE_SL27_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSLE_Bits.SL27 */
#define IFX_MSC_DSDSLE_SL27_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSLE_Bits.SL27 */
#define IFX_MSC_DSDSLE_SL27_OFF (22)

/** \\brief  Length for Ifx_MSC_DSDSLE_Bits.SL28 */
#define IFX_MSC_DSDSLE_SL28_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSLE_Bits.SL28 */
#define IFX_MSC_DSDSLE_SL28_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSLE_Bits.SL28 */
#define IFX_MSC_DSDSLE_SL28_OFF (24)

/** \\brief  Length for Ifx_MSC_DSDSLE_Bits.SL29 */
#define IFX_MSC_DSDSLE_SL29_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSLE_Bits.SL29 */
#define IFX_MSC_DSDSLE_SL29_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSLE_Bits.SL29 */
#define IFX_MSC_DSDSLE_SL29_OFF (26)

/** \\brief  Length for Ifx_MSC_DSDSLE_Bits.SL30 */
#define IFX_MSC_DSDSLE_SL30_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSLE_Bits.SL30 */
#define IFX_MSC_DSDSLE_SL30_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSLE_Bits.SL30 */
#define IFX_MSC_DSDSLE_SL30_OFF (28)

/** \\brief  Length for Ifx_MSC_DSDSLE_Bits.SL31 */
#define IFX_MSC_DSDSLE_SL31_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSLE_Bits.SL31 */
#define IFX_MSC_DSDSLE_SL31_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSLE_Bits.SL31 */
#define IFX_MSC_DSDSLE_SL31_OFF (30)

/** \\brief  Length for Ifx_MSC_DSS_Bits.CFA */
#define IFX_MSC_DSS_CFA_LEN (1)

/** \\brief  Mask for Ifx_MSC_DSS_Bits.CFA */
#define IFX_MSC_DSS_CFA_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_DSS_Bits.CFA */
#define IFX_MSC_DSS_CFA_OFF (25)

/** \\brief  Length for Ifx_MSC_DSS_Bits.DC */
#define IFX_MSC_DSS_DC_LEN (8)

/** \\brief  Mask for Ifx_MSC_DSS_Bits.DC */
#define IFX_MSC_DSS_DC_MSK (0xff)

/** \\brief  Offset for Ifx_MSC_DSS_Bits.DC */
#define IFX_MSC_DSS_DC_OFF (16)

/** \\brief  Length for Ifx_MSC_DSS_Bits.DFA */
#define IFX_MSC_DSS_DFA_LEN (1)

/** \\brief  Mask for Ifx_MSC_DSS_Bits.DFA */
#define IFX_MSC_DSS_DFA_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_DSS_Bits.DFA */
#define IFX_MSC_DSS_DFA_OFF (24)

/** \\brief  Length for Ifx_MSC_DSS_Bits.NPTF */
#define IFX_MSC_DSS_NPTF_LEN (4)

/** \\brief  Mask for Ifx_MSC_DSS_Bits.NPTF */
#define IFX_MSC_DSS_NPTF_MSK (0xf)

/** \\brief  Offset for Ifx_MSC_DSS_Bits.NPTF */
#define IFX_MSC_DSS_NPTF_OFF (8)

/** \\brief  Length for Ifx_MSC_DSS_Bits.PFC */
#define IFX_MSC_DSS_PFC_LEN (4)

/** \\brief  Mask for Ifx_MSC_DSS_Bits.PFC */
#define IFX_MSC_DSS_PFC_MSK (0xf)

/** \\brief  Offset for Ifx_MSC_DSS_Bits.PFC */
#define IFX_MSC_DSS_PFC_OFF (0)

/** \\brief  Length for Ifx_MSC_DSTE_Bits.NDD */
#define IFX_MSC_DSTE_NDD_LEN (4)

/** \\brief  Mask for Ifx_MSC_DSTE_Bits.NDD */
#define IFX_MSC_DSTE_NDD_MSK (0xf)

/** \\brief  Offset for Ifx_MSC_DSTE_Bits.NDD */
#define IFX_MSC_DSTE_NDD_OFF (8)

/** \\brief  Length for Ifx_MSC_DSTE_Bits.PPCE */
#define IFX_MSC_DSTE_PPCE_LEN (6)

/** \\brief  Mask for Ifx_MSC_DSTE_Bits.PPCE */
#define IFX_MSC_DSTE_PPCE_MSK (0x3f)

/** \\brief  Offset for Ifx_MSC_DSTE_Bits.PPCE */
#define IFX_MSC_DSTE_PPCE_OFF (2)

/** \\brief  Length for Ifx_MSC_DSTE_Bits.PPDE */
#define IFX_MSC_DSTE_PPDE_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSTE_Bits.PPDE */
#define IFX_MSC_DSTE_PPDE_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSTE_Bits.PPDE */
#define IFX_MSC_DSTE_PPDE_OFF (0)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENH0 */
#define IFX_MSC_ESR_ENH0_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENH0 */
#define IFX_MSC_ESR_ENH0_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENH0 */
#define IFX_MSC_ESR_ENH0_OFF (16)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENH10 */
#define IFX_MSC_ESR_ENH10_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENH10 */
#define IFX_MSC_ESR_ENH10_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENH10 */
#define IFX_MSC_ESR_ENH10_OFF (26)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENH11 */
#define IFX_MSC_ESR_ENH11_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENH11 */
#define IFX_MSC_ESR_ENH11_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENH11 */
#define IFX_MSC_ESR_ENH11_OFF (27)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENH12 */
#define IFX_MSC_ESR_ENH12_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENH12 */
#define IFX_MSC_ESR_ENH12_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENH12 */
#define IFX_MSC_ESR_ENH12_OFF (28)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENH13 */
#define IFX_MSC_ESR_ENH13_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENH13 */
#define IFX_MSC_ESR_ENH13_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENH13 */
#define IFX_MSC_ESR_ENH13_OFF (29)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENH14 */
#define IFX_MSC_ESR_ENH14_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENH14 */
#define IFX_MSC_ESR_ENH14_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENH14 */
#define IFX_MSC_ESR_ENH14_OFF (30)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENH15 */
#define IFX_MSC_ESR_ENH15_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENH15 */
#define IFX_MSC_ESR_ENH15_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENH15 */
#define IFX_MSC_ESR_ENH15_OFF (31)

/** \\brief  Length for Ifx_MSC_ESR_Bits.ENH1 */
#define IFX_MSC_ESR_ENH1_LEN (1)

/** \\brief  Mask for Ifx_MSC_ESR_Bits.ENH1 */
#define IFX_MSC_ESR_ENH1_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ESR_Bits.ENH1 */
#define IFX_MSC_ESR_ENH1_OFF (17)

