keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxMsc_bf.h
/** \\brief  Offset for Ifx_MSC_ISC_Bits.CCP */
#define IFX_MSC_ISC_CCP_OFF (5)

/** \\brief  Length for Ifx_MSC_ISC_Bits.CDDIS */
#define IFX_MSC_ISC_CDDIS_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISC_Bits.CDDIS */
#define IFX_MSC_ISC_CDDIS_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISC_Bits.CDDIS */
#define IFX_MSC_ISC_CDDIS_OFF (6)

/** \\brief  Length for Ifx_MSC_ISC_Bits.CDECI */
#define IFX_MSC_ISC_CDECI_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISC_Bits.CDECI */
#define IFX_MSC_ISC_CDECI_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISC_Bits.CDECI */
#define IFX_MSC_ISC_CDECI_OFF (1)

/** \\brief  Length for Ifx_MSC_ISC_Bits.CDEDI */
#define IFX_MSC_ISC_CDEDI_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISC_Bits.CDEDI */
#define IFX_MSC_ISC_CDEDI_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISC_Bits.CDEDI */
#define IFX_MSC_ISC_CDEDI_OFF (0)

/** \\brief  Length for Ifx_MSC_ISC_Bits.CDP */
#define IFX_MSC_ISC_CDP_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISC_Bits.CDP */
#define IFX_MSC_ISC_CDP_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISC_Bits.CDP */
#define IFX_MSC_ISC_CDP_OFF (4)

/** \\brief  Length for Ifx_MSC_ISC_Bits.CDTFI */
#define IFX_MSC_ISC_CDTFI_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISC_Bits.CDTFI */
#define IFX_MSC_ISC_CDTFI_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISC_Bits.CDTFI */
#define IFX_MSC_ISC_CDTFI_OFF (2)

/** \\brief  Length for Ifx_MSC_ISC_Bits.CURDI */
#define IFX_MSC_ISC_CURDI_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISC_Bits.CURDI */
#define IFX_MSC_ISC_CURDI_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISC_Bits.CURDI */
#define IFX_MSC_ISC_CURDI_OFF (3)

/** \\brief  Length for Ifx_MSC_ISC_Bits.SCP */
#define IFX_MSC_ISC_SCP_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISC_Bits.SCP */
#define IFX_MSC_ISC_SCP_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISC_Bits.SCP */
#define IFX_MSC_ISC_SCP_OFF (21)

/** \\brief  Length for Ifx_MSC_ISC_Bits.SDDIS */
#define IFX_MSC_ISC_SDDIS_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISC_Bits.SDDIS */
#define IFX_MSC_ISC_SDDIS_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISC_Bits.SDDIS */
#define IFX_MSC_ISC_SDDIS_OFF (22)

/** \\brief  Length for Ifx_MSC_ISC_Bits.SDECI */
#define IFX_MSC_ISC_SDECI_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISC_Bits.SDECI */
#define IFX_MSC_ISC_SDECI_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISC_Bits.SDECI */
#define IFX_MSC_ISC_SDECI_OFF (17)

/** \\brief  Length for Ifx_MSC_ISC_Bits.SDEDI */
#define IFX_MSC_ISC_SDEDI_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISC_Bits.SDEDI */
#define IFX_MSC_ISC_SDEDI_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISC_Bits.SDEDI */
#define IFX_MSC_ISC_SDEDI_OFF (16)

/** \\brief  Length for Ifx_MSC_ISC_Bits.SDP */
#define IFX_MSC_ISC_SDP_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISC_Bits.SDP */
#define IFX_MSC_ISC_SDP_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISC_Bits.SDP */
#define IFX_MSC_ISC_SDP_OFF (20)

/** \\brief  Length for Ifx_MSC_ISC_Bits.SDTFI */
#define IFX_MSC_ISC_SDTFI_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISC_Bits.SDTFI */
#define IFX_MSC_ISC_SDTFI_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISC_Bits.SDTFI */
#define IFX_MSC_ISC_SDTFI_OFF (18)

/** \\brief  Length for Ifx_MSC_ISC_Bits.SURDI */
#define IFX_MSC_ISC_SURDI_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISC_Bits.SURDI */
#define IFX_MSC_ISC_SURDI_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISC_Bits.SURDI */
#define IFX_MSC_ISC_SURDI_OFF (19)

/** \\brief  Length for Ifx_MSC_ISR_Bits.DECI */
#define IFX_MSC_ISR_DECI_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISR_Bits.DECI */
#define IFX_MSC_ISR_DECI_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISR_Bits.DECI */
#define IFX_MSC_ISR_DECI_OFF (1)

/** \\brief  Length for Ifx_MSC_ISR_Bits.DEDI */
#define IFX_MSC_ISR_DEDI_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISR_Bits.DEDI */
#define IFX_MSC_ISR_DEDI_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISR_Bits.DEDI */
#define IFX_MSC_ISR_DEDI_OFF (0)

/** \\brief  Length for Ifx_MSC_ISR_Bits.DTFI */
#define IFX_MSC_ISR_DTFI_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISR_Bits.DTFI */
#define IFX_MSC_ISR_DTFI_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISR_Bits.DTFI */
#define IFX_MSC_ISR_DTFI_OFF (2)

/** \\brief  Length for Ifx_MSC_ISR_Bits.URDI */
#define IFX_MSC_ISR_URDI_LEN (1)

/** \\brief  Mask for Ifx_MSC_ISR_Bits.URDI */
#define IFX_MSC_ISR_URDI_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_ISR_Bits.URDI */
#define IFX_MSC_ISR_URDI_OFF (3)

/** \\brief  Length for Ifx_MSC_KRST0_Bits.RST */
#define IFX_MSC_KRST0_RST_LEN (1)

/** \\brief  Mask for Ifx_MSC_KRST0_Bits.RST */
#define IFX_MSC_KRST0_RST_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_KRST0_Bits.RST */
#define IFX_MSC_KRST0_RST_OFF (0)

/** \\brief  Length for Ifx_MSC_KRST0_Bits.RSTSTAT */
#define IFX_MSC_KRST0_RSTSTAT_LEN (1)

/** \\brief  Mask for Ifx_MSC_KRST0_Bits.RSTSTAT */
#define IFX_MSC_KRST0_RSTSTAT_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_KRST0_Bits.RSTSTAT */
#define IFX_MSC_KRST0_RSTSTAT_OFF (1)

/** \\brief  Length for Ifx_MSC_KRST1_Bits.RST */
#define IFX_MSC_KRST1_RST_LEN (1)

/** \\brief  Mask for Ifx_MSC_KRST1_Bits.RST */
#define IFX_MSC_KRST1_RST_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_KRST1_Bits.RST */
#define IFX_MSC_KRST1_RST_OFF (0)

/** \\brief  Length for Ifx_MSC_KRSTCLR_Bits.CLR */
#define IFX_MSC_KRSTCLR_CLR_LEN (1)

/** \\brief  Mask for Ifx_MSC_KRSTCLR_Bits.CLR */
#define IFX_MSC_KRSTCLR_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_KRSTCLR_Bits.CLR */
#define IFX_MSC_KRSTCLR_CLR_OFF (0)

/** \\brief  Length for Ifx_MSC_OCR_Bits.CLKCTRL */
#define IFX_MSC_OCR_CLKCTRL_LEN (1)

/** \\brief  Mask for Ifx_MSC_OCR_Bits.CLKCTRL */
#define IFX_MSC_OCR_CLKCTRL_MSK (0x1)

/** \\brief  Offset for Ifx_MSC_OCR_Bits.CLKCTRL */
#define IFX_MSC_OCR_CLKCTRL_OFF (8)

/** \\brief  Length for Ifx_MSC_OCR_Bits.CLP */
#define IFX_MSC_OCR_CLP_LEN (1)

/** \\brief  Mask for Ifx_MSC_OCR_Bits.CLP */
#define IFX_MSC_OCR_CLP_MSK (0x1)

